#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/devperimental/package-setup/runs/run-K1MZT3QHTQPkUfVi

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
github_repository_collaborator.a_repo_collaborator["component-settings"]: Refreshing state... [id=component-settings:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-email"]: Refreshing state... [id=component-email:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-sms"]: Refreshing state... [id=component-sms:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-externalapis"]: Refreshing state... [id=component-externalapis:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-dataaccess"]: Refreshing state... [id=component-dataaccess:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-payments"]: Refreshing state... [id=component-payments:chrisxpr]
github_repository_collaborator.a_repo_collaborator["component-servicehelper"]: Refreshing state... [id=component-servicehelper:chrisxpr]
github_repository.template-repo["component-settings"]: Refreshing state... [id=component-settings]
github_repository.template-repo["component-servicehelper"]: Refreshing state... [id=component-servicehelper]
github_repository.template-repo["component-sms"]: Refreshing state... [id=component-sms]
github_repository.template-repo["component-dataaccess"]: Refreshing state... [id=component-dataaccess]
github_repository.template-repo["component-payments"]: Refreshing state... [id=component-payments]
github_repository.template-repo["component-queues"]: Refreshing state... [id=component-queues]
github_repository.template-repo["component-storage"]: Refreshing state... [id=component-storage]
github_repository.template-repo["component-email"]: Refreshing state... [id=component-email]
github_repository.template-repo["component-externalapis"]: Refreshing state... [id=component-externalapis]
github_actions_secret.repo_secret["component-email"]: Refreshing state... [id=component-email:NUGET_PAT]
github_actions_secret.repo_secret["component-sms"]: Refreshing state... [id=component-sms:NUGET_PAT]
github_actions_secret.repo_secret["component-settings"]: Refreshing state... [id=component-settings:NUGET_PAT]
github_actions_secret.repo_secret["component-dataaccess"]: Refreshing state... [id=component-dataaccess:NUGET_PAT]
github_actions_secret.repo_secret["component-payments"]: Refreshing state... [id=component-payments:NUGET_PAT]
github_actions_secret.repo_secret["component-externalapis"]: Refreshing state... [id=component-externalapis:NUGET_PAT]
github_actions_secret.repo_secret["component-servicehelper"]: Refreshing state... [id=component-servicehelper:NUGET_PAT]
github_branch_protection.template-repo["component-payments"]: Refreshing state... [id=BPR_kwDOJCfPqc4CEZ5e]
github_branch_protection.template-repo["component-dataaccess"]: Refreshing state... [id=BPR_kwDOJCfPns4CEZ5f]
github_branch_protection.template-repo["component-settings"]: Refreshing state... [id=BPR_kwDOJCfPss4CEZ5j]
github_branch_protection.template-repo["component-email"]: Refreshing state... [id=BPR_kwDOJCfPzc4CEZ5i]
github_branch_protection.template-repo["component-servicehelper"]: Refreshing state... [id=BPR_kwDOJCfP0s4CEZ5d]
github_branch_protection.template-repo["component-queues"]: Refreshing state... [id=BPR_kwDOJFIBWc4CFS98]
github_branch_protection.template-repo["component-sms"]: Refreshing state... [id=BPR_kwDOJCfPls4CEZ5c]
github_branch_protection.template-repo["component-externalapis"]: Refreshing state... [id=BPR_kwDOJCfPt84CEZ5a]
github_branch_protection.template-repo["component-storage"]: Refreshing state... [id=BPR_kwDOJFIBVs4CFS97]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.repo_secret["component-dataaccess"] must be replaced
-/+ resource "github_actions_secret" "repo_secret" {
      ~ created_at      = "2023-02-25 23:52:40 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "component-dataaccess:NUGET_PAT" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-02-25 23:52:40 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.repo_secret["component-email"] must be replaced
-/+ resource "github_actions_secret" "repo_secret" {
      ~ created_at      = "2023-02-25 23:50:55 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "component-email:NUGET_PAT" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-02-25 23:50:55 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.repo_secret["component-externalapis"] must be replaced
-/+ resource "github_actions_secret" "repo_secret" {
      ~ created_at      = "2023-02-25 23:52:23 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "component-externalapis:NUGET_PAT" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-02-25 23:52:23 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.repo_secret["component-payments"] must be replaced
-/+ resource "github_actions_secret" "repo_secret" {
      ~ created_at      = "2023-02-25 23:50:59 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "component-payments:NUGET_PAT" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-02-25 23:50:59 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.repo_secret["component-queues"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-queues"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repo_secret["component-servicehelper"] must be replaced
-/+ resource "github_actions_secret" "repo_secret" {
      ~ created_at      = "2023-02-25 23:50:50 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "component-servicehelper:NUGET_PAT" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-03 23:52:25 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.repo_secret["component-settings"] must be replaced
-/+ resource "github_actions_secret" "repo_secret" {
      ~ created_at      = "2023-02-25 23:52:33 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "component-settings:NUGET_PAT" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-03 23:52:24 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.repo_secret["component-sms"] must be replaced
-/+ resource "github_actions_secret" "repo_secret" {
      ~ created_at      = "2023-02-25 23:52:24 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "component-sms:NUGET_PAT" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-02-25 23:52:24 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.repo_secret["component-storage"] will be created
  + resource "github_actions_secret" "repo_secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "component-storage"
      + secret_name     = "NUGET_PAT"
      + updated_at      = (known after apply)
    }

  # github_repository_collaborator.a_repo_collaborator["component-queues"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-queues"
      + username                    = "chrisxpr"
    }

  # github_repository_collaborator.a_repo_collaborator["component-storage"] will be created
  + resource "github_repository_collaborator" "a_repo_collaborator" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "component-storage"
      + username                    = "chrisxpr"
    }

Plan: 11 to add, 0 to change, 7 to destroy.


```

</details>

*Pushed by: @devperimental, Action: `pull_request`*